# DataConversionMonitorScope Properties

---
The DataConversionMonitorScope type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace